mokeYQL/esp-brookesia/products/Replica_ai/sdkconfig.defaults
# ============================================
# 基础系统配置
# ============================================
# 目标芯片：ESP32-S3（双核 Xtensa LX7 处理器）
CONFIG_IDF_TARGET="esp32s3"

# 从配置文件获取项目版本号
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
# 当前项目版本：0.12.5 开发版
CONFIG_APP_PROJECT_VER="0.12.5-dev"

# Flash 模式：Quad I/O（4位并行读写，最大化读取速度）
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# Flash 容量：16MB（支持存储 AI 模型、音频文件和 UI 资源）
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# 使用自定义分区表（非标准分区表）
CONFIG_PARTITION_TABLE_CUSTOM=y

# ============================================
# 语音识别与语音合成配置【已禁用 - 项目未使用语音功能】
# ============================================
# 启用语音识别：WakeWord9 识别引擎
# CONFIG_SR_WN_WN9_HILEXIN=y
# 启用语音合成：NihaomiaoBans TTS2（中文语音合成）
# CONFIG_SR_WN_WN9_NIHAOMIAOBAN_TTS2=y

# ============================================
# 编译器性能优化
# ============================================
# 编译器优化级别：性能优先（-O2/-O3），而非代码体积优化
# 权衡：运行速度最快，但代码体积较大，功耗略高
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ============================================
# TLS/SSL 安全配置【已禁用 - 项目未使用 HTTPS/TLS 功能】
# ============================================
# 不使用 DS 数字签名外设（节省功耗和硬件资源）
# CONFIG_ESP_TLS_USE_DS_PERIPHERAL=n
# 允许不安全的 TLS 连接（仅适用于开发/测试环境！）
# CONFIG_ESP_TLS_INSECURE=y
# 跳过服务器证书验证（开发调试用，生产环境必须禁用！）
# CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# ============================================
# PSRAM（外部 SPI RAM）配置 ⭐ 核心配置
# ============================================
# 启用外部 PSRAM：8MB Octal SPI RAM
CONFIG_SPIRAM=y
# PSRAM 模式：八线模式（8位并行传输，提供最高带宽）
CONFIG_SPIRAM_MODE_OCT=y
# PSRAM 速度：80MHz（最高频率）
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
# malloc 分配策略：0 = 优先使用 PSRAM（适合大块内存分配）
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
# WiFi 和 LWIP 协议栈缓冲区分配到 PSRAM（节省内部 SRAM）【已禁用 WiFi】
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# 允许 BSS 段（未初始化全局变量）放在外部内存
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# ============================================
# CPU 和性能配置
# ============================================
# CPU 默认频率：240MHz（最高性能模式）
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# 数据缓存行大小：64字节（匹配硬件特性，优化缓存命中率）
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# ============================================
# 任务栈和看门狗配置
# ============================================
# 主任务栈大小：20KB（足够大避免栈溢出）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=20480
# 控制台输出：USB Serial JTAG（用于调试，占用 USB 口）
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# 中断看门狗超时：2000ms（中断处理超过 2 秒则重启）
CONFIG_ESP_INT_WDT_TIMEOUT_MS=2000
# 任务看门狗超时：10秒（任务阻塞超过 10 秒则重启）
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# ============================================
# WiFi 性能优化配置【已禁用 - 项目未使用 WiFi 功能】
# ============================================
# 动态分配 RX 管理缓冲区（按需分配，省内存）
# CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
# TX 块确认窗口：16（提高吞吐量，适合流媒体音频）
# CONFIG_ESP_WIFI_TX_BA_WIN=16
# RX 块确认窗口：6
# CONFIG_ESP_WIFI_RX_BA_WIN=6
# 不将 WiFi 驱动放入 IRAM（节省内部 RAM，性能略降）
# CONFIG_ESP_WIFI_IRAM_OPT=n
# 不将 WiFi RX 放入 IRAM（节省内部 RAM）
# CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# ============================================
# 文件系统配置【已禁用 - 项目未使用 FATFS 文件系统】
# ============================================
# FATFS 长文件名在堆上分配（支持长文件名，占用堆内存）
# CONFIG_FATFS_LFN_HEAP=y
# FATFS 使用卷标签（支持磁盘卷名显示）
# CONFIG_FATFS_USE_LABEL=y

# ============================================
# FreeRTOS 实时操作系统配置
# ============================================
# RTOS 时钟频率：1000Hz（1ms tick，提供高精度时间片）
CONFIG_FREERTOS_HZ=1000
# 启用向后兼容模式（支持旧版 FreeRTOS API）
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
# 定时器任务栈深度：4096 字节
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
# 任务列表包含 CPU 核心信息（便于调试多核任务）
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
# 生成运行时统计（启用 CPU 使用率统计，用于性能分析）
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# ============================================
# LWIP 网络协议栈配置【已禁用 - 项目未使用网络功能】
# ============================================
# TCP 发送缓冲区默认大小：65535 字节（64KB，支持大文件传输）
# CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
# TCP 接收队列大小：10
# CONFIG_LWIP_TCP_RECVMBOX_SIZE=10
# TCP 接受队列大小：8
# CONFIG_LWIP_TCP_ACCEPTMBOX_SIZE=8
# TCP 乱序报文最大缓冲数：6
# CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=6
# NTP 服务器最大数量：2
# CONFIG_LWIP_SNTP_MAX_SERVERS=2
# DHCP 自动获取 NTP 服务器（简化时间同步配置）
# CONFIG_LWIP_DHCP_GET_NTP_SRV=y
# DHCP 最大 NTP 服务器数量：2
# CONFIG_LWIP_DHCP_MAX_NTP_SERVERS=2
# 启用备用 DNS 服务器支持
# CONFIG_LWIP_FALLBACK_DNS_SERVER_SUPPORT=y
# 允许为特定网络接口设置 DNS 服务器
# CONFIG_LWIP_DNS_SETSERVER_WITH_NETIF=y

# ============================================
# MbedTLS 加密库内存配置【已禁用 - 与 TLS 一同禁用】
# ============================================
# TLS 使用外部内存分配（大缓冲区放入 PSRAM，节省内部 RAM）
# CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# 启用动态缓冲区（按需扩展，减少静态内存占用）
# CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
# 不保存对端证书（节省内存，生产环境应考虑启用）
# CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n

# ============================================
# Brookesia 系统配置【已禁用 - 项目未使用 Brookesia AI 框架】
# ============================================
# 禁用 Phone 系统（此项目不使用电话功能）
# CONFIG_ESP_BROOKESIA_SYSTEMS_ENABLE_PHONE=n

# ============================================
# BSP（板级支持包）配置【已禁用 - 项目未使用 LCD 显示】
# ============================================
# I2C 总线编号：0（使用第一个 I2C 控制器）
# CONFIG_BSP_I2C_NUM=0
# LCD 绘图缓冲区高度：15 行（平衡内存占用和渲染效率）
# CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=15
# LCD 双缓冲（避免屏幕撕裂，一帧显示时下一帧在后台渲染）
# CONFIG_BSP_LCD_DRAW_BUF_DOUBLE=y

# ============================================
# Boost 库配置【已禁用 - 减少代码体积】
# ============================================
# 禁用 Boost 数学库（减少代码体积，不使用数学功能）
CONFIG_BOOST_MATH_ENABLED=n
# 禁用 Boost 序列化库（减少代码体积）
CONFIG_BOOST_SERIALIZATION_ENABLED=n

# ============================================
# ESP Utils 内存配置
# ============================================
# 内存分配类型：ESP 标准分配器
CONFIG_ESP_UTILS_CONF_MEM_GEN_ALLOC_TYPE_ESP=y
# 启用 C++ 全局运算符 new/delete
CONFIG_ESP_UTILS_CONF_MEM_ENABLE_CXX_GLOB_ALLOC=y
# C++ 全局分配使用 ESP PSRAM 能力（大对象自动分配到 PSRAM）
CONFIG_ESP_UTILS_CONF_MEM_CXX_GLOB_ALLOC_ESP_CAPS_PSRAM=y

# ============================================
# 音频播放器配置【已禁用 - 项目未使用音频播放功能】
# ============================================
# 重采样目标采样率：16000Hz（人声频率范围的最佳采样率）
# CONFIG_AUDIO_SIMPLE_PLAYER_RESAMPLE_DEST_RATE=16000
# 启用音频通道转换（立体声/单声道转换）
# CONFIG_ESP_AUDIO_SIMPLE_PLAYER_CH_CVT_EN=y
# 启用音频位深转换
# CONFIG_ESP_AUDIO_SIMPLE_PLAYER_BIT_CVT_EN=y
# 目标位深：32 位浮点（提供足够的动态范围用于音频处理）
# CONFIG_AUDIO_SIMPLE_PLAYER_BIT_CVT_DEST_32BIT=y

# ============================================
# LCD 触摸屏配置【已禁用 - 项目未使用触摸屏功能】
# ============================================
# 禁用 CST816S 触摸控制器读取 ID（兼容性修复）
# CONFIG_ESP_LCD_TOUCH_CST816S_DISABLE_READ_ID=y

# ============================================
# 内存映射文件配置【已禁用 - 项目未使用内存映射文件功能】
# ============================================
# 内存映射文件名最大长度：32 字符
# CONFIG_MMAP_FILE_NAME_LENGTH=32

# ============================================
# TinyUSB 配置（USB 设备功能）【已禁用 - 项目未使用 USB 功能】
# ============================================
# 不使用默认 USB PID（产品 ID）
# CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
# 自定义 USB PID：0x4001（用于识别设备型号）
# CONFIG_TINYUSB_DESC_CUSTOM_PID=0x4001
# 启用 USB MSC（大容量存储，设备可作为 U 盘）
# CONFIG_TINYUSB_MSC_ENABLED=y
# USB MSC 缓冲区大小：4KB
# CONFIG_TINYUSB_MSC_BUFSIZE=4096
# USB 网络模式：NCM（设备可作为 USB 网卡，用于调试）
# CONFIG_TINYUSB_NET_MODE_NCM=y

# ============================================
# WebSocket 客户端配置【已禁用 - 项目未使用 WebSocket 功能】
# ============================================
# WebSocket 使用分离的 TX 锁（提高并发性能）
# CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y

# ============================================
# LVGL 图形库配置（GUI 框架）【已禁用 - 项目未使用 LCD 显示功能】
# ============================================
# LVGL 使用 C 标准库 malloc
# CONFIG_LV_USE_CLIB_MALLOC=y
# LVGL 使用 C 标准库字符串函数
# CONFIG_LV_USE_CLIB_STRING=y
# LVGL 使用 C 标准库 sprintf
# CONFIG_LV_USE_CLIB_SPRINTF=y
# LVGL 默认刷新周期：10ms（100fps，流畅动画）
# CONFIG_LV_DEF_REFR_PERIOD=10
# LVGL 操作系统：FreeRTOS
# CONFIG_LV_OS_FREERTOS=y
# 软件绘图单元数量：2（利用双核，Core0 处理逻辑，Core1 渲染）
# CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
# 启用 LVGL 日志
# CONFIG_LV_USE_LOG=y
# LVGL 日志使用 printf 输出
# CONFIG_LV_LOG_PRINTF=y
# 启用对象样式缓存（提升渲染性能）
# CONFIG_LV_OBJ_STYLE_CACHE=y
# ============================================
# LVGL 字体配置（Montserrat 系列）【已禁用 - 项目未使用 LCD 显示功能】
# ============================================
# 预加载多种字体尺寸，避免运行时解析延迟
# CONFIG_LV_FONT_MONTSERRAT_8=y    # 8pt：最小字体（图标、标签）
# CONFIG_LV_FONT_MONTSERRAT_10=y   # 10pt：小字体（辅助信息）
# CONFIG_LV_FONT_MONTSERRAT_12=y   # 12pt：正文小号
# CONFIG_LV_FONT_MONTSERRAT_16=y   # 16pt：正文标准
# CONFIG_LV_FONT_MONTSERRAT_18=y   # 18pt：正文大号
# CONFIG_LV_FONT_MONTSERRAT_20=y   # 20pt：小标题
# CONFIG_LV_FONT_MONTSERRAT_22=y   # 22pt：标题
# CONFIG_LV_FONT_MONTSERRAT_24=y   # 24pt：大标题
# CONFIG_LV_FONT_MONTSERRAT_26=y   # 26pt：特大标题
# CONFIG_LV_FONT_MONTSERRAT_28=y   # 28pt：超大标题
# CONFIG_LV_FONT_MONTSERRAT_30=y   # 30pt：超大标题
# CONFIG_LV_FONT_MONTSERRAT_32=y   # 32pt：超特大标题
# CONFIG_LV_FONT_MONTSERRAT_34=y   # 34pt：超特大标题
# CONFIG_LV_FONT_MONTSERRAT_36=y   # 36pt：超特大标题
# CONFIG_LV_FONT_MONTSERRAT_38=y   # 38pt：超大标题
# CONFIG_LV_FONT_MONTSERRAT_40=y   # 40pt：超大标题
# CONFIG_LV_FONT_MONTSERRAT_42=y   # 42pt：超大标题
# CONFIG_LV_FONT_MONTSERRAT_44=y   # 44pt：超大标题
# 字体格式：大模式（支持超大字符集）
# CONFIG_LV_FONT_FMT_TXT_LARGE=y
# 启用字体压缩（节省 Flash 占用约 50%）
# CONFIG_LV_USE_FONT_COMPRESSED=y
# 启用二维码生成功能【已禁用 - 项目未使用二维码功能】
# CONFIG_LV_USE_QRCODE=y
# 不构建 LVGL 示例代码（节省编译时间）
# CONFIG_LV_BUILD_EXAMPLES=n

# ============================================
# ESP-IDF 实验性功能
# ============================================
# 启用实验性功能（允许使用不稳定的 API）
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
